RULES = [
    {
        "triggers": ["привет", "здравств", "добрый день", "доброго дня", "хай", "хелло", "hello"],
        "responses": [
            "Привет 👋",
            "Здравствуй 😄",
            "Хеллоу! ✌️",
            "Вай! Какие люди! 😁",
            "Категорически приветствую 🤝",
        ],
    },
        [
    {
        "triggers": ["спокойной ночи", "доброй ночи", "сладких снов", "споки"],
        "responses": [
            "Спокойной ночи 🌙",
            "Сладких снов 😴",
            "Пусть ночь будет уютной ✨",
        ],
    },
]
